app/controllers/games_controller.rb

INSERT INTO "games" ("score", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["score", 123], ["user_id", 1], ["created_at", "2015-07-04 22:34:19.498424"], ["updated_at", "2015-07-04 22:34:19.498424"]]
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save

DELETE FROM "games" WHERE "games"."id" = $1  [["id", 1]]
---
  def destroy
    @game.destroy