app/controllers/games_controller.rb

  def index
    @games = Game.all.includes(:user)
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)