app/controllers/home_controller.rb

INSERT INTO "users" ("name", "session_key", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "123"], ["session_key", "b71aae3f98a1982e7748075298f25806"], ["created_at", "2015-07-04 23:02:42.339863"], ["updated_at", "2015-07-04 23:02:42.339863"]]
---
  def login
    user = User.new(name: params[:name], session_key: SecureRandom.hex)

    if user.save!