app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    random_year = Movie.all.order("RANDOM()").first().year