app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "session_key", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "1"], ["session_key", ""], ["created_at", "2015-07-04 22:34:01.563899"], ["updated_at", "2015-07-04 22:34:01.563899"]]